## Pandas_1

### 조건 필터링

In [2]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.3.1

In [ ]:
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70, 95, 95],
    '반': [2, 1, 1, 2]
}
df = pd.DataFrame(data)
df
# 이름	점수	반
# 0	홍길동	90	2
# 1	김철수	70	1
# 2	이영희	95	1
# 3	박민수	95	2

In [ ]:
mask = df["점수"] >= 80
filtered = df[mask]
filtered
# 이름	점수	반
# 0	홍길동	90	2
# 2	이영희	95	1
# 3	박민수	95	2

In [ ]:
# 여러 조건 결합
# and : &
# or : |
# not : ~

# & 예시
mask = (df["반"] == 1) & (df["점수"] >= 80)
df[mask]
#   이름   점수	반
# 2	이영희	95	1

In [ ]:
# | 예시
mask = (df["반"] == 2) | (df["점수"] >= 90)
df[mask]
# 이름	점수	반
# 0	홍길동	90	2
# 2	이영희	95	1
# 3	박민수	95	2

In [ ]:
# isin()
# 여러 값 중에 하나에 해당하는지 여부를 판단할 때 사용

msdk = (df["이름"] == "홍길동") | (df["이름"] == "박민수")

mask = df["이름"].isin(["홍길동", "박민수"])
df[mask]
# 이름	점수	반
# 0	홍길동	90	2
# 3	박민수	95	2

In [ ]:
#  ~ 예시

mask = ~ df["이름"].isin(["홍길동", "박민수"])
df[mask]
# 이름	점수	반
# 1	김철수	70	1
# 2	이영희	95	1

In [ ]:
# reset_index()
# 조건 필터링, 정렬 등을 통해 인덱스가 변경됐을시
# reset_index를 사용해서 인덱스를 초기화

mask = (df["반"] == 2) | (df["점수"] >= 90)
df2 = df[mask]
df2
#   이름   점수	반
# 0	홍길동	90	2
# 2	이영희	95	1
# 3	박민수	95	2

# 인덱스 리셋
df2 = df2.reset_index()
df2
# index	이름   점수	 반
# 0	0	홍길동	90	2
# 1	2	이영희	95	1
# 2	3	박민수	95	2

# 기존 인덱스 삭제
df2 = df2.reset_index(drop=True)
df2
#   이름   점수	반
# 0	홍길동	90	2
# 1	이영희	95	1
# 2	박민수	95	2

In [ ]:
# 실습 1. 조건 필터링 연습
df = pd.DataFrame({
'이름': ['민준', '서연', '지후', '서준', '지민'],
'점수': [78, 92, 85, 60, 88],
'반': [1, 2, 1, 2, 1]
})
df

In [ ]:
# 1.
df[df["점수"] >= 80].reset_index(drop=True)

In [ ]:
# 2.
df[(df["반"] == 1) & (df["점수"] >= 85)].reset_index(drop=True)

In [ ]:
df = pd.DataFrame({
'이름': ['민준', '서연', '지후', '서준', '지민'],
'점수': [78, 92, 85, 60, 88],
'반': [1, 2, 1, 2, 1]
})
df

In [ ]:
# 3.
df[df["이름"].isin(["서연", "지민"])]

In [ ]:
# 4.
df[df["이름"].isin(["서연", "지민"])].reset_index(drop=True)

In [ ]:
df = pd.DataFrame({
'이름': ['민준', '서연', '지후', '서준', '지민'],
'점수': [78, 92, 85, 60, 88],
'반': [1, 2, 1, 2, 1]
})
df

In [ ]:
# 5.
df5 = df[(df["점수"] < 80) | (df["반"] == 2)]
df5

In [ ]:
# 6.
df5[df5["점수"] >= 70].reset_index(drop=True)

### 열 추가 및 수정, 삭제

In [ ]:
df = pd.DataFrame({
    '이름': ['김철수', '이영희', '박민수'],
    '국어': [90, 80, 70],
    '영어': [85, 78, 92]
})
df
#   이름   국어	영어
# 0	김철수	90	85
# 1	이영희	80	78
# 2	박민수	70	92

In [ ]:
# 열 추가 및 수정
# df["컬럼명"] = "값"
# 컬럼이 존재하면 수정 / 컬럼이 존재하지 않으면 추가

# 같은 값을 한번에 추가
df["반"] = "1반"
df
#   이름   국어	영어   반
# 0	김철수	90	85	1반
# 1	이영희	80	78	1반
# 2	박민수	70	92	1반

In [ ]:
# 조건문을 통한 추가
df["국어_합격여부"] = df["국어"] >= 80
df
#   이름   국어	영어  반  국어_합격여부
# 0	김철수	90	85	1반	True
# 1	이영희	80	78	1반	True
# 2	박민수	70	92	1반	False

In [ ]:
# 리스트/시리즈를 통한 열 추가
df["학번"] = [101, 102, 103]
df
#   이름   국어	영어  반 국어_합격여부	학번
# 0	김철수	90	85	1반	True	101
# 1	이영희	80	78	1반	True	102
# 2	박민수	70	92	1반	False	103

In [ ]:
# 시리즈의 연산 결과로 새 열 추가
df["총점"] = df["국어"] + df["영어"]
df
#   이름   국어	영어  반 국어_합격여부 학번	총점
# 0	김철수	90	85	1반	True	101	175
# 1	이영희	80	78	1반	True	102	158
# 2	박민수	70	92	1반	False	103	162

In [ ]:
# 새로운 컬럼 추가시, 행의 개수가 맞지 않으면 에러 발생
df["새로운 열"] = [1, 2]

In [ ]:
# 기존 값을 한번에 변경
df["영어"] = 100
df
#   이름   국어	 영어 반 국어_합격여부 학번	총점
# 0	김철수	90	100	1반	True	101	175
# 1	이영희	80	100	1반	True	102	158
# 2	박민수	70	100	1반	False	103	162

In [ ]:
# 열 삭제 : drop
# 단일 열 삭제
df2 = df.drop("반", axis=1)
df2
#   이름   국어	영어 국어_합격여부 학번	총점
# 0	김철수	90	100	True	101	175
# 1	이영희	80	100	True	102	158
# 2	박민수	70	100	False	103	162

In [ ]:
# 여러 열 삭제
df3 = df2.drop(["총점", "국어_합격여부"], axis=1)
df3
#   이름   국어	영어  학번
# 0	김철수	90	100	101
# 1	이영희	80	100	102
# 2	박민수	70	100	103

In [ ]:
# 원본에서 삭제
df.drop("반", axis=1, inplace=True)
df
#   이름   국어	영어 국어_합격여부 학번	총점
# 0	김철수	90	100	True	101	175
# 1	이영희	80	100	True	102	158
# 2	박민수	70	100	False	103	162

In [ ]:
# 기타 삭제 방법
del df["총점"]
df
#   이름   국어	영어 국어_합격여부 학번
# 0	김철수	90	100	True	101
# 1	이영희	80	100	True	102
# 2	박민수	70	100	False	103

deleted = df.pop("국어_합격여부")
deleted
# 0     True
# 1     True
# 2    False
# Name: 국어_합격여부, dtype: bool

### 행 추가 및 수정, 삭제

In [ ]:
df = pd.DataFrame({
    '이름': ['김철수', '이영희'],
    '나이': [23, 25]
})
df
#   이름   나이
# 0	김철수	23
# 1	이영희	25

In [ ]:
# 행추가 :concat
# 새 행을 추가하기
new_row = pd.DataFrame([{"이름": "태현", "나이": 27}])

df = pd.concat([df, new_row])
df
# 이름	나이
# 0	김철수	23
# 1	이영희	25
# 0	태현	27

# 인덱스 재정렬
df = pd.concat([df, new_row], ignore_index=True)
df
#   이름	나이
# 0	김철수	 23
# 1	이영희	 25
# 2	태현	27

In [ ]:
# 여러 행 추가하기
new_rows = pd.DataFrame([{"이름": "태현", "나이": 27},
                        {"이름": "이름1", "나이": 22},
                        {"이름": "이름2", "나이": 26}])

df = pd.concat([df, new_rows], ignore_index=True)
df
#   이름	나이
# 0	김철수	 23
# 1	이영희	 25
# 2	태현	27
# 3	이름1	22
# 4	이름2	26

In [ ]:
# 행 수정
# loc, iloc을 활용
df.loc[1] = ["김영희", 35]
df
#   이름	나이
# 0	김철수	23
# 1	김영희	35
# 2	태현	27
# 3	이름1	22
# 4	이름2	26

df.loc[0, "나이"] = 18
df
#   이름	나이
# 0	김철수	18
# 1	김영희	35
# 2	태현	27
# 3	이름1	22
# 4	이름2	26

In [ ]:
df.loc[1:3, "나이"] = 11, 12, 13
df
#   이름	나이
# 0	김철수	18
# 1	김영희	11
# 2	태현	12
# 3	이름1	13
# 4	이름2	26

In [ ]:
# 
df.loc[1:2, ["이름", "나이"]] = [["new1", 100], ["new2", 200]]
df
#   이름	나이
# 0	김철수	 18
# 1	new1	100
# 2	new2	200
# 3	이름1	 13
# 4	이름2	 26

In [ ]:
# 행 삭제 : drop
# axis 기본값 = 0
# 단일 행 삭제
df2 = df.drop(1).reset_index(drop=True)
df2
#   이름	나이
# 0	김철수	 18
# 1	new2	200
# 2	이름1	 13
# 3	이름2	 26

In [ ]:
# 여러 행 삭제
df3 = df.drop([0, 2]).reset_index(drop=True)
df3
#   이름	나이
# 0	new1	100
# 1	이름1	 13
# 2	이름2	 26

In [ ]:
# 조건을 이용한 삭제
df = df[df["나이"] >= 20]
df
#   이름	나이
# 1	new1	100
# 2	new2	200
# 4	태현	 27
# 5	이름1	 22
# 6	이름2	 26

In [ ]:
# 실습 2. 행/열 추가, 수정, 삭제
df = pd.DataFrame({
'이름': ['김철수', '이영희', '박민수'],
'국어': [90, 80, 70]
})
df

In [ ]:
# 1.
df["수학"] = [95, 100, 88]
df

In [ ]:
# 2.
df2 = df.drop("이름", axis=1)
df2

In [ ]:
df = pd.DataFrame({
'제품': ['A', 'B'],
'가격': [1000, 2000]
})
df

In [ ]:
# 3.
new_item = pd.DataFrame([{"제품":"C", "가격":1500}])
df = pd.concat([df, new_item], ignore_index=True)
df

In [ ]:
# 4.
df.drop(0, inplace=True)
df

In [ ]:
df = pd.DataFrame({
'과목': ['국어', '영어', '수학'],
'점수': [85, 90, 78]
})
df

In [ ]:
# 5.
df = df[df["점수"] >= 80]
df

In [ ]:
# 6.
df6 = df.copy()
df6["학년"] = 1
df6

In [ ]:
df = pd.DataFrame({
'이름': ['A', 'B'],
'나이': [20, 22]
})
df

In [ ]:
# 7.
new = pd.DataFrame([{"이름":"C", "나이":25, "키":np.nan}])
df = pd.concat([df, new], ignore_index=True)
df

In [ ]:
df = pd.DataFrame({
'부서': ['영업', '기획', '개발', '디자인'],
'인원': [3, 2, 5, 1]
})
df

In [ ]:
# 8.
df = df[df["인원"] > 2].reset_index(drop=True)
df

In [ ]:
# 9.
df["평가"] = "미정"
df

### 문자열 데이터 처리

In [ ]:
# 데이터프레임 준비
data = {
    'name': [' Alice ', 'Bob', 'Charlie ', 'David', 'Eve'],
    'email': ['alice@email.com', 'bob@naver.com', 'charlie@gmail.com', 'david@naver.com', 'eve@gmail.com'],
    'info': ['서울, 25세', '부산, 30세', '대전, 22세', '대구, 27세', '광주, 24세']
}
df = pd.DataFrame(data)

### 정렬
- 값 기준 정렬 : sort_values
- 인덱스 기준 정렬 : sort_index

In [ ]:
# 값 기준 정렬 : sort_values

In [ ]:
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70, 85, 95],
    '반': [2, 1, 1, 2]
}
df = pd.DataFrame(data)
df
#   이름   점수	반
# 0	홍길동	90	2
# 1	김철수	70	1
# 2	이영희	85	1
# 3	박민수	95	2

    이름  점수  반
0  홍길동  90  2
1  김철수  70  1
2  이영희  85  1
3  박민수  95  2

In [ ]:
# 오름차순 정렬
df2 = df.sort_values(by="점수").reset_index(drop=True)
df2
#   이름   점수	반
# 0	김철수	70	1
# 1	이영희	85	1
# 2	홍길동	90	2
# 3	박민수	95	2

In [ ]:
# 내림차순 정렬
# ascending=False
df3 = df.sort_values("점수", ascending=False).reset_index(drop=True)
df3
#   이름   점수	반
# 0	박민수	95	2
# 1	홍길동	90	2
# 2	이영희	85	1
# 3	김철수	70	1

In [ ]:
# 여러 기준을 사용하여 정렬
df4 = df.sort_values(["반", "점수"], ascending=[True, False]).reset_index(drop=True)
df4
#   이름   점수	반
# 0	이영희	85	1
# 1	김철수	70	1
# 2	박민수	95	2
# 3	홍길동	90	2

In [ ]:
# 원본 변경
df.sort_values(["반", "점수"], ascending=[True, False], inplace=True)
df.reset_index(drop=True)
#   이름   점수	반
# 0	이영희	85	1
# 1	김철수	70	1
# 2	박민수	95	2
# 3	홍길동	90	2

In [ ]:
# 인덱스 기준 정렬 : sort_index

In [ ]:
df_shuffled = df.sample(frac=1, random_state=42)
df_shuffled
#   이름   점수	반
# 1	김철수	70	1
# 0	홍길동	90	2
# 2	이영희	85	1
# 3	박민수	95	2

# 행 인덱스 기준으로 정렬
df5 = df_shuffled.sort_index()
df5
#   이름   점수	반
# 0	홍길동	90	2
# 1	김철수	70	1
# 2	이영희	85	1
# 3	박민수	95	2

# 열 이름 기준 정렬 (알파벳순)
df6 = df5.sort_index(axis=1)
df6
#   반	 이름	점수
# 0	2	홍길동	90
# 1	1	김철수	70
# 2	1	이영희	85
# 3	2	박민수	95

In [ ]:
# 실습3. 정렬
df = pd.DataFrame({
'name': ['Alice', 'Bob', 'Charlie', 'David'],
'score': [88, 95, 70, 100]
})
df

In [ ]:
# 1.
df1 = df.sort_values("score").reset_index(drop=True)
df1

In [ ]:
# 2.
df2 = df.sort_values("score", ascending=False).reset_index(drop=True)
df2

In [ ]:
df = pd.DataFrame({
'이름': ['가', '나', '다', '라', '마'],
'반': [2, 1, 1, 2, 1],
'점수': [90, 85, 80, 95, 85]
})
df

In [ ]:
# 3.
df3 = df.sort_values(["반", "점수"], ascending=[True, False]).reset_index(drop=True)
df3

In [ ]:
# 4.
df4 = df3.sort_index(axis=1)
df4

In [ ]:
df = pd.DataFrame({
'value': [10, 20, 30, 40]
}, index=[3, 1, 4, 2])
df

In [ ]:
# 5.
df5 = df.sort_index()
df5

In [ ]:
# 6.
df6_index = df.sort_index(ascending=False)
df6_values = df.sort_values("value").reset_index(drop=True)
print("index 기준 내림차순\n", df6_index)
print("value 기준 오름차순\n", df6_values)

### groupby

In [ ]:
df = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'name': ['Kim', 'Lee', 'Park', 'Choi', 'Jung', 'Han'],
    'score': [90, 85, 80, 70, 95, 88]
})
df
# team	name	score
# 0	A	Kim	    90
# 1	A	Lee	    85
# 2	B	Park	80
# 3	B	Choi	70
# 4	B	Jung	95
# 5	C	Han	    88

  team  name  score
0    A   Kim     90
1    A   Lee     85
2    B  Park     80
3    B  Choi     70
4    B  Jung     95
5    C   Han     88

In [ ]:
# 단일 컬럼 기준 그룹화

grouped = df.groupby("team")

# 집계함수 적용

# 합계
result_sum = grouped["score"].sum()
result_sum
# team
# A    175
# B    245
# C     88
# Name: score, dtype: int64

# 평균
result_mean = grouped["score"].mean()
result_mean
# team
# A    87.500000
# B    81.666667
# C    88.000000
# Name: score, dtype: float64

# 개수
result_count = grouped["score"].count()
result_count
# team
# A    2
# B    3
# C    1
# Name: score, dtype: int64

In [ ]:
df2 = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'gender': ['M', 'F', 'F', 'M', 'M', 'F'],
    'score': [90, 85, 80, 70, 95, 88]
})
df2
# team	gender	score
# 0	A	M	    90
# 1	A	F	    85
# 2	B	F	    80
# 3	B	M	    70
# 4	B	M	    95
# 5	C	F	    88

  team gender  score
0    A      M     90
1    A      F     85
2    B      F     80
3    B      M     70
4    B      M     95
5    C      F     88

In [ ]:
# 여러 컬럼 기준 그룹화

result = df2.groupby(["team", "gender"])["score"].mean()
result
# team  gender
# A     F         85.0
#       M         90.0
# B     F         80.0
#       M         82.5
# C     F         88.0
# Name: score, dtype: float64

team  gender
A     F         85.0
      M         90.0
B     F         80.0
      M         82.5
C     F         88.0
Name: score, dtype: float64

In [ ]:
# as_indext=False : 그룹 라벨이 인덱스로 설정됨

result = df2.groupby("team", as_index=False)["score"].sum()
result
# team	score
# 0	A	175
# 1	B	245
# 2	C	88

  team  score
0    A    175
1    B    245
2    C     88

In [ ]:
# 여러 집계 함수를 한번에 적용 : agg()

result = df2.groupby("team", as_index=False)["score"].agg(["sum", "mean", "count"])
result
# team	sum	mean	count
# 0	A	175	87.500000	2
# 1	B	245	81.666667	3
# 2	C	88	88.000000	1

  team  sum       mean  count
0    A  175  87.500000      2
1    B  245  81.666667      3
2    C   88  88.000000      1

In [ ]:
df2 = pd.DataFrame({
    'team': ['A', 'A', 'B', 'B', 'B', 'C'],
    'gender': ['M', 'F', 'F', 'M', 'M', 'F'],
    'score': [90, 85, 80, 70, 95, 88],
    "age": [22, 23, 24, 25, 26, 27]
})
df2
# team	gender	score	age
# 0	A	M	    90	    22
# 1	A	F	    85	    23
# 2	B	F	    80	    24
# 3	B	M	    70	    25
# 4	B	M	    95	    26
# 5	C	F	    88	    27

  team gender  score  age
0    A      M     90   22
1    A      F     85   23
2    B      F     80   24
3    B      M     70   25
4    B      M     95   26
5    C      F     88   27

In [ ]:
# 그룹별로 여러 컬럼에 다른 집계 함수 적용
result = df2.groupby("team").agg({
    "score": "mean",
    "age": "max"
})
result
#       score	age
# team		
# A	87.500000	23
# B	81.666667	26
# C	88.000000	27

          score  age
team
A     87.500000   23
B     81.666667   26
C     88.000000   27

In [134]:
# 실습 4. groupby 연습문제
df = pd.DataFrame({
'grade': [1, 2, 1, 2, 1, 3],
'name': ['Kim', 'Lee', 'Park', 'Choi', 'Jung', 'Han'],
'kor': [85, 78, 90, 92, 80, 75]
})
df

   grade  name  kor
0      1   Kim   85
1      2   Lee   78
2      1  Park   90
3      2  Choi   92
4      1  Jung   80
5      3   Han   75

In [136]:
# 1.
result = df.groupby("grade", as_index=False)["kor"].mean()
result

   grade   kor
0      1  85.0
1      2  85.0
2      3  75.0

In [151]:
df = pd.DataFrame({
'class': [1, 1, 1, 2, 2, 2],
'subject': ['Math', 'Math', 'Eng', 'Math', 'Eng', 'Eng'],
'score': [80, 90, 85, 70, 95, 90]
})
df

   class subject  score
0      1    Math     80
1      1    Math     90
2      1     Eng     85
3      2    Math     70
4      2     Eng     95
5      2     Eng     90

In [152]:
# 2.
result = df.groupby(["class", "subject"], as_index=False)["score"].agg(["count", "mean"])
result

   class subject  count  mean
0      1     Eng      1  85.0
1      1    Math      2  85.0
2      2     Eng      2  92.5
3      2    Math      1  70.0

In [166]:
df = pd.DataFrame({
'region': ['Seoul', 'Seoul', 'Busan', 'Busan', 'Daegu'],
'seller': ['A', 'B', 'A', 'B', 'A'],
'sales': [100, 200, 150, 120, 130]
})
df

  region seller  sales
0  Seoul      A    100
1  Seoul      B    200
2  Busan      A    150
3  Busan      B    120
4  Daegu      A    130

In [149]:
# 3.
result = df.groupby(["region", "seller"], as_index=False)["sales"].agg(["sum", "max"])
result

  region seller  sum  max
0  Busan      A  150  150
1  Busan      B  120  120
2  Daegu      A  130  130
3  Seoul      A  100  100
4  Seoul      B  200  200

In [154]:
df = pd.DataFrame({
'team': ['A', 'A', 'B', 'B', 'A', 'B'],
'position': ['FW', 'DF', 'FW', 'DF', 'DF', 'FW'],
'score': [3, 2, None, 1, 4, 2]
})
df

  team position  score
0    A       FW    3.0
1    A       DF    2.0
2    B       FW    NaN
3    B       DF    1.0
4    A       DF    4.0
5    B       FW    2.0

In [156]:
# 4.
result = df.groupby(["team", "position"], as_index=False)["score"].mean()
result

  team position  score
0    A       DF    3.0
1    A       FW    3.0
2    B       DF    1.0
3    B       FW    2.0

In [ ]:
df = pd.DataFrame({
'dept': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
'gender': ['M', 'F', 'F', 'M', 'F', 'F'],
'salary': [3500, 3200, 4000, 4200, 3000, 3100]
})
df
# dept	    gender	salary
# 0	HR	    M	    3500
# 1	HR	    F	    3200
# 2	IT	    F	    4000
# 3	IT	    M	    4200
# 4	Sales	F	    3000
# 5	Sales	F	    3100

    dept gender  salary
0     HR      M    3500
1     HR      F    3200
2     IT      F    4000
3     IT      M    4200
4  Sales      F    3000
5  Sales      F    3100

In [ ]:
# 컬럼 이름 설정 가능
result = df.groupby(["dept", "gender"]).agg(
    count=("salary", "count"),
    total_salary=("salary", "sum")
)
result
#               count	total_salary
# dept	gender		
# HR	F	    1	    3200
#       M	    1	    3500
# IT	F	    1	    4000
#       M	    1	    4200
# Sales	F	    2	    6100

              count  total_salary
dept  gender
HR    F           1          3200
      M           1          3500
IT    F           1          4000
      M           1          4200
Sales F           2          6100